INIT_MESSAGE = """Привет! Этот бот дает возможность сгенироровать шпаргалку из отправленного текста.\n
Для начала, давайте откалибруем бота. Вам будет отправлен текст, 
полученное уведомление просмотрите на своем носимом устройстве и введите примерное количество символов, 
которые отобразились на вашем дисплее часов или браслета. Далее будет отправлен этот же текст, 
но разбитый на несколько частей (по количеству символов) в нескольких уведомлений.
Eсли текст вместился правильно, нажмите Готово, если нет, нажмите Еще раз.

Введите предполагаемое количество символов"""
TEST_TEXT = """Крошка сын
к отцу пришел,
и спросила кроха:
— Что такое
хорошо
и что такое
плохо?- 
У меня
секретов нет,-
слушайте, детишки,-
папы этого
ответ
помещаю
в книжке.

— Если ветер
крыши рвет,
если
град загрохал,-
каждый знает —
это вот
для прогулок
плохо.
Дождь покапал
и прошел.
Солнце
в целом свете.
Это —
очень хорошо
и большим
и детям.

Если
сын
чернее ночи,
грязь лежит
на рожице,-
ясно,
это
плохо очень
для ребячьей кожицы.

Если
мальчик
любит мыло
и зубной порошок,
этот мальчик
очень милый,
поступает хорошо.

Если бьет
дрянной драчун
слабого мальчишку,
я такого
не хочу
даже
вставить в книжку.

Этот вот кричит:
— Не трожь
тех,
кто меньше ростом!-
Этот мальчик
так хорош,
загляденье просто!
Если ты
порвал подряд
книжицу
и мячик,
октябрята говорят:
плоховатый мальчик.

Если мальчик
любит труд,
тычет
в книжку
пальчик,
про такого
пишут тут:
он
хороший мальчик.

От вороны
карапуз
убежал, заохав.
Мальчик этот
просто трус.
Это
очень плохо.

Этот,
хоть и сам с вершок,
спорит
с грозной птицей.
Храбрый мальчик,
хорошо,
в жизни
пригодится.
Этот
в грязь полез
и рад.
что грязна рубаха.
Про такого
говорят:
он плохой,
неряха.
Этот
чистит валенки,
моет
сам
галоши.
Он
хотя и маленький,
но вполне хороший.

Помни
это
каждый сын.
Знай
любой ребенок:
вырастет
из сына
cвин,
если сын —
свиненок,
Мальчик
радостный пошел,
и решила кроха:
«Буду
делать хорошо,
и не буду —
плохо»."""









    
